#include<stdio.h> 
#include<stdlib.h>
#include<time.h>
#include<windows.h>

//int main()
//{
//	/*
//	    二维数组
//		  定义格式和遍历
//
//		    方式一：
//			   m：表示二维数组的长度
//			   n：表示每一个一维数组的长度
//			   数据类型 arr[m][n]=
//			   {
//			      {1,2,...},
//			      {1,2,...},
//			      {1,2,...},
//			      {1,2,...},
//			      {1,2,...}
//	           }
//	        遍历：利用索引进行遍历/利用指针进行遍历
//	        方式二：
//			   核心：事先把所有一维数组定义完毕，再放入二维数组中
//			   
//	*/
//
//	//1.定义一个二维数组
//	int arr[3][5] =
//	{
//		{1,2,3,4,5},//arr[0]
//		{11,22,33,44,55},//arr[1]
//		{111,222,333,444,555}//arr[2]
//	};
//	////2.来利用索引的方式进行遍历
//	////arr[0]:表示二维数组里面当中的第一个一维数组
//
//	//for (int i = 0;i < 3;i++)
//	//{
//	//	for (int j = 0;j < 5;j++)
//	//	{
//	//		printf("%d ", arr[i][j]);
//	//	}
//	//	//内循环结束
//	//	printf("\n");
//	//}
//	////1.定义三个一维数组
//	//int arr1[] = { 1,2,3,4 };
//	//int arr2[] = { 11,22,33,44,55 };
//	//int arr3[] = { 111,222,333,444,555,666 };
//
//	///*
//	//  注意：
//	//   不能在循环里算数组长度，要在外面算
//	//
//	//*/
//	//int len1 = sizeof(arr1) / sizeof(int);
//	//int len2 = sizeof(arr2) / sizeof(int);
//	//int len3 = sizeof(arr3) / sizeof(int);
//
//	////补充：利用另外的数组来储存
//	//int lenArr[] = { len1,len2,len3 };
//
//
//	////2.把三个一维放入二维
//	//int* arr[3] = { arr1,arr2,arr3 };//存的不是数组，是内存地址
//	////3.遍历数组
//	//for (int i = 0;i < 3;i++)
//	//{
//	//	//int len = sizeof(arr[i]) / sizeof(int);//这里的arr[i]为内存地址是指针，不是整个数组，所以这种该方法不行,arr[i]占八个字节，int4个，结果为二
//	//	for (int j = 0;j < lenArr[i];j++)//事先计算数组的长度，在指针数组里只是一个首地址
//	//	{
//	//		printf("%d ", arr[i][j]);
//	//	}
//	//	printf("\n");
//	//}
//
//	int(*p)[3] = arr;
//
//
//
//
//	return 0;
//}