//#include<stdio.h> 
//#include<stdlib.h>
//#include<time.h>
//#include<windows.h>
//
//int main()
//{
//	/*
//	    二维数组
//		  利用指针遍历
//	
//	
//	
//	
//	*/
//	//// 方式一：
//	////1.定义一个二维数组
//	//int arr[3][5] =
//	//{
//	//	{1,2,3,4,5},
//	//	{11,22,33,44,55},
//	//	{111,222,333,444,555}
//	//};
//
//	////2.利用指针遍历二维数组
//	//  //获取二维数组的指针
//	//  //数组指针的数据类型：跟内部元素类型一致
//	//  
//	//int(*p)[5] = arr;
//
//	//for (int i = 0;i < 3;i++)
//	//{
//	//	//遍历数组
//	//	for (int j = 0;j < 5;j++)
//	//	{
//	//		printf("%d ", *(*p + j));
//	//	}
//	//	printf("\n");
//	//	p++;//移动指针，下一个步长
//	//}
//
//	// 方式二：第二种二维指针
//	  //1.定义
//	int arr1[] = { 1,2,3,4 };
//	int arr2[] = { 11,22,33 };
//
//	//获取数组的长度
//	int len1 = sizeof(arr1) / sizeof(int);
//	int len2 = sizeof(arr2) / sizeof(int);
//	
//	//利用数组储存长度
//	int lenArr[] = { len1,len2 };
//
//	  //2.储存内存地址
//	int* arr[2] = {arr1,arr2};
//
//	  //3.利用指针遍历
//	int** p = arr;
//
//	for (int i = 0;i < 2;i++)
//	{
//		for (int j = 0;j < lenArr[i];j++)
//		{
//
//			printf("%d ", *(*p + j));//遍历单个数组中的数据
//
//		}
//		printf("\n");
//		p++;//移动指针
//	}
//
//	/*
//	   
//	
//	
//	*/
//
//
//
//	return 0;
//}