//#include<string.h>
//#include<stdio.h>
//
//int main()
//{
//	////&& 与（而且） 两边都为真，结果才是真(同时满足）
//	////|| 或（或者） 两边都为假，结果才是假（二选一）
//	////！ 非（取反） 取反
//
//
//	////1.键盘录入一个两位数
//	//int a;
//	//printf("请输入一个两位数：\n");
//	//scanf("%d", &a);
//	//
//	////两位数不包含7
//	//printf("%d\n", a / 10 % 10 != 7 && a % 10 != 7);
//
//	int b;
//	printf("请输入一个两位数：\n");//键盘录入
//	scanf("%d", &b);
//	//两位数不包含7还要满足不是7的倍数。
//	int b1 = b / 10 % 10 != 7 && b % 10 != 7;//不含7
//	int b2 = b % 7 != 0;//不是7的倍数
//	printf("%d\n", b1 == 1 && b2 == 1);//可以多个a&&b&&c多个成立，||也一样
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}