#include<string.h>
#include<stdio.h> 
//
//int main()
//{
//	/*
//	     if的格式
//		   if（关系表达式）
//		   {  
//		       语句体
//
//		   }
//		   else
//		   {
//
//		   }
//	1.需求：判断变量a里面记录的值，是否大于10，如果成立，就打印语句，真的大于10
//	
//	
//	
//	*/
//	//double temperature;
//	//scanf("%f", &temperature);//键盘录入
//	//if (temperature >= 38.0);
//	//{
//	//	printf("体温过高，语音警报");
//	//}
//	//
//
//	//需求：游戏中的人物血条
//	//初始最大生命：200
//	//受到了伤害：80
//	//恢复了血量：100
//	//当前的血量？
//
//	//int boold=200;//初始
//	//int damage=80;//伤害
//	//int restore=100;//回复
//
//	//boold = boold - damage + restore;//计算
//	// 
//	//if (boold >= 200)
//	//{
//	//	boold = 200;
//	//}
//	//else
//
//	//定义一个整数表示我心爱的姑娘对我的好感度。
//	//如果大于等于60，就同意我的表白。
//	//否则，我就去表白别人
//
//
//
//
//	////练习1
//	//int love;//定义好感度
//	//printf("姑娘对我的好感度：");
//	//scanf("%d", &love);//键盘录入
//	//if (love >= 60)//两条线路
//	//{
//	//	printf("表白成功！");
//	//}
//	//else
//	//{
//	//	printf("表白失败...继续努力！");
//	//}
//
//	/*需求
//	*    我跟小诗一起去看电影
//	*    如果在同一排且连着坐，我会开心的看电影
//	*    如果不是同一排或者没有连着坐，我会开心的打游戏
//	
//	
//	
//	//*/
//	//int rowA = 5;
//	//int numberA = 7;//定义两个变量
//
//	//int rowB = 6;
//	//int numberB = 6;
//	////在同一排且连着坐：rowA==rowB  &&  numberA-numberB=1   ||  numberA-numberB=-1
//	//if ((rowA == rowB) && (numberA - numberB == 1 || numberA - numberB == -1))
//	//{
//
//	//	printf("我会开心的看电影！");
//	//}
//	//else
//	//{
//	//	printf("我会开心的打游戏!");
//	//}
//
//
//	////定义一个变量
//	//int money;
//	//printf("请输入您充值的金额：\n");//美观
//	//scanf("%d", &money);//键盘录入金额
//	//printf("您充值了%d元\n", money);//提示
//	//if (money >= 1 && money <= 99)
//	//{
//	//	printf("恭喜您成为尊贵的VIP1用户!");
//	//}
//	//else if (money >= 100 && money <= 499)
//	//{
//	//	printf("恭喜您成为尊贵的VIP2用户!");
//	//}
//	//else if (money >= 500 && money <= 999)
//	//{
//	//	printf("恭喜您成为尊贵的VIP3用户!");
//	//}
//	//else if (money >= 1000 && money <= 1999)
//	//{
//	//	printf("恭喜您成为尊贵的VIP4用户!");
//	//}
//	//else if (money >= 2000 )
//	//{
//	//	printf("恭喜您成为顶级的VIP5用户!\n您成为至高的存在！享受无上的荣誉！");
//	//}
//double score;//定义
//printf("期末总分为：100分\n请输入您的分数：");
//scanf("%lf", &score);//录入
////if (score <0 || score > 100)
////{
////	printf("超出分数范围！");
////}
////else if (score >= 85.0)
////{
////	printf("评级为A\n优秀的同学，恭喜你取得了非常棒的成绩，但不可以骄傲喔！");
////}
////else if (score < 85.0 && score>=70.0)
////{
////	printf("评级为B\n同学，恭喜你取得了比较不错的成绩，继续加油！");
////}
////else if (score < 70.0 && score >= 60.0)
////{
////	printf("评级为C\n同学加把劲，继续努力！");
////}
////else 
////{
////	printf("评级为D\n同学不要放弃，坚持到底的勇气会成为你逆袭的底气！");
////}
// 
// 
// 
// 
// 
// 
////练习2
//if (score < 0 || score > 100)
//{
//	printf("超出分数范围！");
//}
//else
//{
//	if (score >= 85.0)
//	{
//		printf("评级为A\n优秀的同学，恭喜你取得了非常棒的成绩，但不可以骄傲喔！");
//	}
//	else if (score < 85.0 && score >= 70.0)
//	{
//		printf("评级为B\n同学，恭喜你取得了比较不错的成绩，继续加油！");
//	}
//	else if (score < 70.0 && score >= 60.0)
//	{
//		printf("评级为C\n同学加把劲，继续努力！");
//	}
//	else
//	{
//		printf("评级为D\n同学不要放弃，坚持到底的勇气会成为你逆袭的底气！");
//
//	}
//}
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//
//	return 0;
//}